In [38]:
import sqlite3
conn = sqlite3.connect("my database.db")
cursor = conn.cursor()

In [39]:
cursor.execute("""
Create Table If Not Exists student(
        id Integer PRIMARY KEY,name Text Not Null,age Integer,grade Text)

""");

In [40]:
cursor.execute("insert into student(name,age, grade )Values(?,?,?)",("ayesha",22,"A"))

In [41]:
conn.commit()

In [42]:
cursor.execute("SELECT * FROM student")
print(cursor.fetchall())

[(None, 'ayesha', 34, 'A'), (None, 'ayesha', 34, 'A'), (None, 'ayesha', 22, 'A')]

In [43]:
cursor.execute(" UPDATE student  SET age= 34 where name = 'ayesha'")

In [44]:
conn.commit()

In [45]:

cursor.execute("SELECT * FROM student")
print(cursor.fetchall())

[(None, 'ayesha', 34, 'A'), (None, 'ayesha', 34, 'A'), (None, 'ayesha', 34, 'A')]

Assignment

In [47]:
import sqlite3

# Connect to database
conn = sqlite3.connect("school.db")
cursor = conn.cursor()
cursor.execute("""
CREATE TABLE IF NOT EXISTS Students(
    StudentID INTEGER PRIMARY KEY,
    Name TEXT NOT NULL,
    Age INTEGER,
    City TEXT
)
""")

# Step 3: Insert sample records
cursor.execute("DELETE FROM Students")   # clear old data if rerun
cursor.executemany("""
INSERT INTO Students(StudentID, Name, Age, City)
VALUES (?, ?, ?, ?)
""", [
    (1, "Ayesha", 22, "Lahore"),
    (2, "Ali", 21, "Karachi"),
    (3, "Sara", 23, "Lahore"),
    (4, "Usman", 20, "Islamabad")
])
conn.commit()


# Run the query
cursor.execute("SELECT * FROM Students")
rows = cursor.fetchall()

# Print results
print("All Students:")
for row in rows:
    print(row)

# Close connection
conn.close()

All Students:
(1, 'Ayesha', 22, 'Lahore')
(2, 'Ali', 21, 'Karachi')
(3, 'Sara', 23, 'Lahore')
(4, 'Usman', 20, 'Islamabad')

In [48]:
import sqlite3

# Connect to database
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# Run the query
cursor.execute("SELECT Name FROM Students WHERE City = 'Lahore'")
rows = cursor.fetchall()

# Print results
print("Students living in Lahore:")
for row in rows:
    print(row[0])   # row[0] because only Name column is selected

# Close connection
conn.close()

Students living in Lahore:
Ayesha
Sara

In [49]:
import sqlite3

# Connect to database
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# Run the query
cursor.execute("SELECT * FROM Students ORDER BY Age DESC")
rows = cursor.fetchall()

# Print results
print("Students ordered by Age (descending):")
for row in rows:
    print(row)   # shows full row: (StudentID, Name, Age, City)

# Close connection
conn.close()

Students ordered by Age (descending):
(3, 'Sara', 23, 'Lahore')
(1, 'Ayesha', 22, 'Lahore')
(2, 'Ali', 21, 'Karachi')
(4, 'Usman', 20, 'Islamabad')

In [50]:
import sqlite3

# Connect to database
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# Create Courses table
cursor.execute("""
CREATE TABLE IF NOT EXISTS Courses(
    CourseID INTEGER PRIMARY KEY,
    CourseName TEXT NOT NULL,
    Teacher TEXT
)
""")

# Create Enrollments table
cursor.execute("""
CREATE TABLE IF NOT EXISTS Enrollments(
    EnrollmentID INTEGER PRIMARY KEY,
    StudentID INTEGER,
    CourseID INTEGER,
    FOREIGN KEY(StudentID) REFERENCES Students(StudentID),
    FOREIGN KEY(CourseID) REFERENCES Courses(CourseID)
)
""")

# Insert sample courses
cursor.execute("DELETE FROM Courses")
cursor.executemany("""
INSERT INTO Courses(CourseID, CourseName, Teacher) VALUES (?, ?, ?)
""", [
    (1, "Math", "Mr. Khan"),
    (2, "Science", "Ms. Ali"),
    (3, "History", "Dr. Ahmed")
])

# Insert sample enrollments
cursor.execute("DELETE FROM Enrollments")
cursor.executemany("""
INSERT INTO Enrollments(EnrollmentID, StudentID, CourseID) VALUES (?, ?, ?)
""", [
    (1, 1, 1),  # Ayesha → Math
    (2, 2, 2),  # Ali → Science
    (3, 3, 3),  # Sara → History
    (4, 4, 1)   # Usman → Math
])

conn.commit()

# Run the JOIN query
cursor.execute("""
SELECT Students.Name, Courses.CourseName
FROM Students
JOIN Enrollments ON Students.StudentID = Enrollments.StudentID
JOIN Courses ON Enrollments.CourseID = Courses.CourseID
""")

rows = cursor.fetchall()

# Show results
print("Student Name | Course Name")
print("--------------------------")
for row in rows:
    print(row[0], "|", row[1])

# Close connection
conn.close()

Student Name | Course Name
--------------------------
Ayesha | Math
Ali | Science
Sara | History
Usman | Math

In [51]:
import sqlite3

# Connect to database
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# Run the counting query
cursor.execute("SELECT COUNT(*) FROM Enrollments")
result = cursor.fetchone()   # fetchone() since it’s a single value

# Print the count
print("Total students enrolled:", result[0])

# Close connection
conn.close()

Total students enrolled: 4